package com.gusto.apr032.main;


// 언어
// 	조건문(if, swich)
// 	반복문(for, while, foreach, do-while)
//	배열(x), Collection 중요
//////////////////////////////////////////
// 	객체지향
//	외부 라이브러리활용
//	HTTP통신 - Parsing
/////////////////////////////////////////
// 배열 : 변수 하나에 data를 여러개
//	[  ] 사용
//  만들때 사이즈가 고정이 되어 있어서
//	사이즈를 모르면 배열 만들기가 어렵다.(사실상 불가능)
//  사이즈 변경이 불가능

// 배열의 대체품
//	Collection(컬렉션)
//		Java에서 자료구조를 지칭하는 용어
//		자료구조(data structure) : 자료를 저장하기 위한 구조

// List 계열
//		가변사이즈(사이즈를 바꿀 수 있음)
//		순서가 있음, 중복된 요소 가질 수 있음

// Set 계열(잘 안씀) 
//		가변사이즈
//		중복 데이터는 삭제함
//		순서 랜덤

// Map 계열
//		가변사이즈
//		Key값, Value값이 한쌍
//		Key를 부르면 Value가 같이 ! 
//		순서 개념 x 




public class CMain1 {

}
